var test ="Вычислительная техника";
var peremeshat_voprosi = "да";
var vopros_1 = "Что такое аналоговый сигнал?";
var vopros_2 = "Как называется сигнал, который может принимать только два (иногда — три) значения? ";
var vopros_3 = "Каковы преимущества аналоговых устройств по сравнению с цифровыми? ";
var vopros_4 = "При каком значении синхросигнала переключается динамический триггер? ";
var vopros_5 = "При каком состоянии входов запоминающая ячейка, реализованная на элементах, не изменит своего состояния? ";
var vopros_6 = "В каком типе триггерных схем изменение состояния возможно многократно за период действия синхросигнала при изменении состояния входных сигналов? ";
var vopros_7 = "Какое состояние имеют входы четырехвходового шифратора, если состояние его выходов равно 11?";
var vopros_8 = "Какой из признаков не характеризует дешифратор? ";
var vopros_9 = "Что характеризует триггерные схемы, составляющие регистр хранения? ";
var vopros_10 = "Регистры сдвига строятся на двухступенчатых триггерах для того, чтобы ";
var vopros_11 = "Сколько асинхронных входов сброса в 0 имеет регистр хранения?" ;
var vopros_12 = "Какой счетчик называется реверсивным? ";
var vopros_13 = "Какое состояние имеет трехразрядный суммирующий счетчик, предварительно сброшенный в 0, после поступления на его счетный вход 10-ти сигналов? Какие функции может выполнять регистр сдвига? ";
var vopros_14 = "Для каких целей может использоваться сдвиговый регистр в АЛУ, выполняющем умножение чисел в прямом коде со старших разрядов множителя? ";
var vopros_15 = "Сколько входов для последовательного ввода информации имеется в регистре, осуществляющем сдвиг в одну сторону? ";
var vopros_ris_1 = "нет";
var vopros_ris_2 = "нет";
var vopros_ris_3 = "нет";
var vopros_ris_4 = "нет";
var vopros_ris_5 = "нет";
var vopros_ris_6 = "нет";
var vopros_ris_7 = "нет";
var vopros_ris_8 = "нет";
var vopros_ris_9 = "нет";
var vopros_ris_10 = "нет";
var vopros_ris_11 = "нет";
var vopros_ris_12 = "нет";
var vopros_ris_13 = "нет";
var vopros_ris_14 = "нет";
var vopros_ris_15 = "нет";
var pr_otv_zadachi_1 = "Y+IU40wywg5CRLSQ8Y1iQ/w9wwwg4xUg0wU98giQ+Q1U709UgQ1U7U=";//это сигнал, который может принимать любые значения в определенных пределах  
var pr_otv_zadachi_2 = "xE4ykg"; // цифровой 
var pr_otv_zadachi_3 = "0w4zZLSRDZA1BYwI9A01I9AU6xAYwwgCQ+8wwyZM"; // аналоговые устройства проще проектировать и отлаживать 
var pr_otv_zadachi_4 = "iQ8w1Igc801xPIdAY9yRB1F5Bc98wIA=="; //в момент изменения уровня синхросигнала-
var pr_otv_zadachi_5 = "Uz0wLCBSPTAg";  // S=0, R=0
var pr_otv_zadachi_6 = "iRBRCc14+CRCwzVASAg"; // в статическом триггере  
var pr_otv_zadachi_7 = "MTAwMA=="; // 1000 
var pr_otv_zadachi_8 = "U1AsIw3U904SRBc98+iQ9CQyU+Ug5CQ+SQ+VBVHYwZByRB1F49c4dOw8IU40w48I0wIU1IZFQ1IA=="; // схема, изменение сигналов на выходе которой обеспечивается синхронизирующим сигналом на ее входе 
var pr_otv_zadachi_9 = "VJkgwzQ7IU4VA04RGggIA=="; //общий сигнал синхронизации   
var pr_otv_zadachi_10 = "Y084wgQ3yQ/w1Ag4ykg1EQ8Y4CQyI81ZDiRBc/1MI5CIw3U904yRBVC898gY+45IVC81g="; //отделить фазу приема новой информации в первую ступень от изменения состояния второй ступени
var pr_otv_zadachi_11 = "MQ=="; // 1
var pr_otv_zadachi_12 = "c1c4iwg5B5Pw1I4+5Ac+Iw+VCI4wiRDU7c4RCVPLCRCogCRDU9wwxByQ9CAiMSIgiQ3Y4w8VCCQ+iRCc+LCQ9CQ64+SRBVC85IZFQg5Bc/VCIU40ww=="; // счетчик, состояние которого может как увеличиваться, так и уменьшаться на "1" в зависимости от того, на какой счетный вход поступает сигнал
var pr_otv_zadachi_13 = "MTAg"; // 10  
var pr_otv_zadachi_14 = "9PIU0wzCQ842w+4gAgc1U048IwwUgIA=="; // для сдвига множимого на очередном шаге  
var pr_otv_zadachi_15 = "MQ=="; // 1